const ideasRussian: { [key: string]: string[] } = {
    nature: [
        "Одинокое дерево, вырисовывающееся на фоне яркого заката",
        "Стремительный водопад, ниспадающий со скалистого утеса",
        "Безмятежное озеро, отражающее окружающие горы",
        "Поле полевых цветов, покачивающееся на легком ветру",
        "Густой лес с солнечным светом, пробивающимся сквозь листья",
        "Величественный горный хребет, покрытый снегом",
        "Пустынный пейзаж с возвышающимися кактусами и песчаными дюнами",
        "Тропический пляж с пальмами и кристально чистой водой",
        "Бурный океан с разбивающимися волнами и темными облаками",
        "Звездное ночное небо с видимым Млечным Путем"
    ],
    portrait: [
        "Молодая женщина с пронзительными голубыми глазами и задумчивым выражением лица",
        "Пожилой мужчина с морщинами на лице, рассказывающий историю",
        "Ребенок с озорной улыбкой и искрящимися глазами",
        "Женщина с ярким макияжем и сложной прической",
        "Мужчина с суровым выражением лица и волевой линией подбородка",
        "Человек с уникальными чертами лица и завораживающим взглядом",
        "Портрет, подчеркивающий игру света и тени на лице объекта съемки",
        "Портрет, запечатлевший мимолетную эмоцию, такую как радость или печаль",
        "Портрет в определенном художественном стиле, таком как кубизм или импрессионизм",
        "Автопортрет, выражающий внутренний мир художника"
    ],
    architecture: [
        "Футуристический городской пейзаж с высокими небоскребами и летательными аппаратами",
        "Готический собор с замысловатыми витражами и стрельчатыми арками",
        "Традиционный японский храм с безмятежными садами и богато украшенной резьбой",
        "Музей современного искусства с изящными линиями и минималистским дизайном",
        "Разрушающийся древний руины, заросшие виноградной лозой, и ощущение таинственности",
        "Оживленная городская улица с разнообразной архитектурой и оживленной уличной жизнью",
        "Уютный коттедж, расположенный в живописной сельской местности",
        "Величественный дворец с роскошным убранством и обширной территорией",
        "Подвесной мост, перекинутый через обширный каньон или реку",
        "Заброшенная фабрика со ржавым оборудованием и завораживающей атмосферой"
    ],
    cyberpunk: [
        "Залитый неоновым светом переулок в футуристическом городе с голографической рекламой",
        "Киборг с имплантатами дополненной реальности и изящными кибернетическими усовершенствованиями",
        "Хакер, работающий над сложной компьютерной системой в тускло освещенной комнате",
        "Футуристический автомобиль, мчащийся по многолюдному городскому пейзажу",
        "Мрачный городской пейзаж с возвышающимися мегакорпорациями и гнетущей слежкой",
        "Уличная сцена, где люди и андроиды занимаются своими повседневными делами",
        "Пейзаж виртуальной реальности с яркими цветами и сюрреалистическим окружением",
        "Персонаж, одетый в высокотехнологичный костюм со светящимися вставками и замысловатыми деталями",
        "Сцена, изображающая кибернетически улучшенное животное или существо",
        "Футуристическое оружие или устройство с замысловатым дизайном и передовыми технологиями"
    ],
    adoptables: [
        "Милое и пушистое создание с большими глазами и игривым нравом",
        "Величественное и сильное существо с замысловатыми отметинами и царственной осанкой",
        "Таинственное и загадочное существо с уникальными чертами лица и скрытым прошлым",
        "Причудливое и фантастическое существо с яркими цветами и игривым характером.",
        "Роботизированное или механическое существо со сложными механизмами и металлическими деталями",
        "Существо, созданное на основе определенного животного или мифического существа",
        "Существо с уникальным сочетанием черт и характеристик",
        "Существо, созданное с учетом определенной тематики или эстетики",
        "Существо с предысторией и индивидуальностью, с которыми могут познакомиться потенциальные пользователи",
        "Существо с аксессуарами или одеждой, которые подчеркивают его дизайн и привлекательность"
    ],
    humanization: [
        "Кофейная чашка с сонным выражением лица и паром, поднимающимся при зевке",
        "Книга с мудрым и понимающим выражением лица, страницы которой полны историй",
        "Телефон с яркой и жизнерадостной индивидуальностью, всегда готовый к подключению",
        "Автомобиль с элегантным и спортивным дизайн, стремящийся к открытости",
        "Растение со счастливым и энергичным характером, нежащееся в лучах солнца",
        "Музыкальный инструмент с одухотворенным и выразительным лицом, готовый создавать музыку",
        "Предмет мебели с удобной и располагающей индивидуальностью, идеально подходящий для расслабление.",
        "Полезный и эффективный бытовой прибор, облегчающий работу по дому",
        "Природный элемент, такой как огонь или вода, обладающий мощной и динамичной индивидуальностью",
        "Абстрактное понятие, такое как любовь или страх, персонифицированное с человеческими чертами"
    ],
    anatomy: [
        "Детальное изучение человеческой руки с акцентом на мускулатуру и структуру костей",
        "Исследование человеческого глаза с демонстрацией его сложных деталей",
        "Изучение человеческого торса с выделением грудной клетки, мышц и внутренних органов",
        "Детальный рисунок человеческого тела",
        "Череп, подчеркивающий его анатомические особенности",
        "Сосредоточьтесь на ноге человека, демонстрируя мышцы и кости, участвующие в движении", "Исследуйте позвоночник человека, подчеркивая его гибкость и структуру",
        "Изучение человеческого уха, демонстрация его сложных внутренних компонентов",
        "Детальный рисунок человеческого мозга с выделением его различных областей и функций",
        "Сосредоточьтесь на кровеносной системе человека, демонстрируя сеть артерий и вен",
        "Исследование пищеварительной системы человека, подчеркивая ее органы и процессы."
    ],
    mythology: [
        "Изображение Зевса, царя богов, размахивающего своей молнией",
        "Сцена, в которой Посейдон, бог моря, повелевает волнами с помощью своего трезубца",
        "Иллюстрация Аида, бога подземного мира, правящего своими темными владениями",
        "Изображение изображение Афины, богини мудрости, со своей спутницей-совой",
        "Изображение Афродиты, богини любви и красоты, появляющейся из морской раковины",
        "Сцена, в которой Арес, бог войны, участвует в жестокой битве",
        "Иллюстрация Артемиды, богиня охоты со своим луком и стрелами",
        "Изображение Аполлона, бога музыки и света, играющего на своей лире",
        "Изображение Гермеса, бога-посланника, в крылатых сандалиях и с посохом",
        "Сцена, в которой Гефест, бог огня и кузнечного дела, создает мощное оружие"
    ],
    furry: [
        "Дружелюбный лис с ярко-оранжевой шерстью и пушистым хвостом",
        "Свирепый волк с острыми зубами и решительным выражением лица",
        "Игривый кот с гладкой черной шерстью и пронзительными зелеными глазами",
        "Мудрый филин в больших круглых очках и задумчивым взглядом поведение",
        "Верный пес с висячими ушами и виляющим хвостом",
        "Озорной енот в маске бандита и с хитрой ухмылкой",
        "Грациозный олень с тонкими рогами и нежным выражением лица",
        "Сильный персонаж-медведь с густой шерстью и властной внешностью",
        "Хитрый персонаж-змея с чешуей, которая переливается на свету",
        "Величественный персонаж-дракон с крыльями, простирающимися до неба"
    ],
    animals: [
        "Величественный лев, крадущийся по африканской саванне",
        "Игривый дельфин, выпрыгивающий из океанских волн",
        "Грациозный орел, парящий в небе с распростертыми крыльями",
        "Разноцветный попугай, сидящий на ветке в тропическом лесу",
        "Могучий слон, бродящий по луга со своим стадом",
        "Крадущийся тигр, прячущийся в тени джунглей",
        "Любопытная обезьяна, пробирающаяся по деревьям тропического леса",
        "Ласковый жираф, тянущийся к листьям на высокой акации",
        "Игривый медвежонок панда жует бамбук в бамбуковом лесу",
        "Красочный хамелеон, сливающийся с окружающей обстановкой"
    ],
    fashion: [
        "Струящееся вечернее платье с замысловатой вышивкой бисером и эффектным шлейфом",
        "Элегантный и современный костюм с четкими линиями и индивидуальным кроем",
        "Повседневный и удобный наряд с модными аксессуарами и яркими цветами",
        "Смелый и авангардный ансамбль с использованием нетрадиционных материалов и формы",
        "Платье в винтажном стиле с классическими деталями и неподвластной времени элегантностью",
        "Уличный наряд с удобными кроссовками и графичной футболкой",
        "Образ в богемном стиле с использованием струящихся тканей и натуральных тонов",
        "Футуристический дизайн одежды с использованием инновационных материалов и технологий",
        "Дизайн костюма для определенного персонажа или исторического периода",
        "Коллекция аксессуаров, таких как шляпы, шарфы и украшения"
    ],
    anime: [
        "Динамичная экшн-сцена с персонажем, владеющим мощным оружием",
        "Трогательная сцена с персонажами, переживающими момент нежности",
        "Драматическая сцена с персонажем, сталкивающимся с трудным испытанием",
        "Комедийная сцена с персонажами, играющими в фарс",
        "Романтическая сцена с персонажи, выражающие свою любовь друг к другу",
        "Портрет персонажа, демонстрирующий его уникальную индивидуальность и стиль",
        "Пейзажная сцена, изображающая фантастический мир или обстановку",
        "Сцена, в которой девушка-волшебница превращается в свое могущественное альтер-эго",
        "Сцена, в которой механический робот участвует в эпической битве",
        "Сцена, демонстрирующая особые способности персонажа"
    ]
};

export default ideasRussian;